RT-Thread/rt-thread/bsp/wch/arm/libraries/CH32F10x_StdPeriph_Driver/StdPeriph_Driver/src/ch32f10x_adc.c
/*******************************************************************************
* Function Name  : ADC_Cmd
* Description    : Enables or disables the specified ADC peripheral.
* Input          : ADCx: 
*                    where x can be 1 to select the ADC peripheral.
*                  NewState: ENABLE or DISABLE.
* Return         : None
*******************************************************************************/
void ADC_Cmd(ADC_TypeDef* ADCx, FunctionalState NewState)
{
  if (NewState != DISABLE)
  {
    ADCx->CTLR2 |= CTLR2_ADON_Set;
  }
  else
  {
    ADCx->CTLR2 &= CTLR2_ADON_Reset;
  }
}

/*******************************************************************************
* Function Name  : ADC_DMACmd
* Description    : Enables or disables the specified ADC DMA request.
* Input          : ADCx:
*                    where x can be 1 to select the ADC peripheral.
*                  NewState: ENABLE or DISABLE.
* Return         : None
*******************************************************************************/
void ADC_DMACmd(ADC_TypeDef* ADCx, FunctionalState NewState)
{
  if (NewState != DISABLE)
  {
    ADCx->CTLR2 |= CTLR2_DMA_Set;
  }
  else
  {
    ADCx->CTLR2 &= CTLR2_DMA_Reset;
  }
}

/*******************************************************************************
* Function Name  : ADC_ITConfig
* Description    : Enables or disables the specified ADC interrupts.
* Input          : ADCx:
*                    where x can be 1 to select the ADC peripheral.
*                  ADC_IT: specifies the ADC interrupt sources to be enabled or disabled. 
*                    ADC_IT_EOC: End of conversion interrupt mask.
*                    ADC_IT_AWD: Analog watchdog interrupt mask.
*                    ADC_IT_JEOC: End of injected conversion interrupt mask.
*                  NewState: ENABLE or DISABLE.
* Return         : None
*******************************************************************************/
void ADC_ITConfig(ADC_TypeDef* ADCx, uint16_t ADC_IT, FunctionalState NewState)
{
  uint8_t itmask = 0;

  itmask = (uint8_t)ADC_IT;
	
  if (NewState != DISABLE)
  {
    ADCx->CTLR1 |= itmask;
  }
  else
  {
    ADCx->CTLR1 &= (~(uint32_t)itmask);
  }
}

/*******************************************************************************
* Function Name  : ADC_ResetCalibration
* Description    : Resets the selected ADC calibration registers.
* Input          : ADCx:
*                    where x can be 1 to select the ADC peripheral.
* Return         : None
*******************************************************************************/
void ADC_ResetCalibration(ADC_TypeDef* ADCx)
{
  ADCx->CTLR2 |= CTLR2_RSTCAL_Set;
}

/*******************************************************************************
* Function Name  : ADC_GetResetCalibrationStatus
* Description    : Gets the selected ADC reset calibration registers status.
* Input          : ADCx:
*                    where x can be 1 to select the ADC peripheral.
* Return         : FlagStatus: SET or RESET.
*******************************************************************************/
FlagStatus ADC_GetResetCalibrationStatus(ADC_TypeDef* ADCx)
{
  FlagStatus bitstatus = RESET;

  if ((ADCx->CTLR2 & CTLR2_RSTCAL_Set) != (uint32_t)RESET)
  {
    bitstatus = SET;
  }
  else
  {
    bitstatus = RESET;
  }
	
  return  bitstatus;
}

/*******************************************************************************
* Function Name  : ADC_StartCalibration
* Description    : Starts the selected ADC calibration process.
* Input          : ADCx:
*                    where x can be 1 to select the ADC peripheral.
* Return         : None
*******************************************************************************/
void ADC_StartCalibration(ADC_TypeDef* ADCx)
{ 
  ADCx->CTLR2 |= CTLR2_CAL_Set;
}

/*******************************************************************************
* Function Name  : ADC_GetCalibrationStatus
* Description    : Starts the selected ADC calibration process.
* Input          : ADCx:
*                    where x can be 1 to select the ADC peripheral.
* Return         : FlagStatus: SET or RESET.
*******************************************************************************/
FlagStatus ADC_GetCalibrationStatus(ADC_TypeDef* ADCx)
{
  FlagStatus bitstatus = RESET;

  if ((ADCx->CTLR2 & CTLR2_CAL_Set) != (uint32_t)RESET)
  {
    bitstatus = SET;
  }
  else
  {
    bitstatus = RESET;
  }

  return  bitstatus;
}

/*******************************************************************************
* Function Name  : ADC_SoftwareStartConvCmd
* Description    : Enables or disables the selected ADC software start conversion.
* Input          : ADCx:
*                    where x can be 1 to select the ADC peripheral.
*                  NewState: ENABLE or DISABLE.
* Return         : None
*******************************************************************************/
void ADC_SoftwareStartConvCmd(ADC_TypeDef* ADCx, FunctionalState NewState)
{
  if (NewState != DISABLE)
  {
    ADCx->CTLR2 |= CTLR2_EXTTRIG_SWSTART_Set;
  }
  else
  {
    ADCx->CTLR2 &= CTLR2_EXTTRIG_SWSTART_Reset;
  }
}

/*******************************************************************************
* Function Name  : ADC_GetSoftwareStartConvStatus
* Description    : Gets the selected ADC Software start conversion Status.
* Input          : ADCx:
*                    where x can be 1 to select the ADC peripheral.
* Return         : FlagStatus: SET or RESET.
*******************************************************************************/
FlagStatus ADC_GetSoftwareStartConvStatus(ADC_TypeDef* ADCx)
{
  FlagStatus bitstatus = RESET;

  if ((ADCx->CTLR2 & CTLR2_SWSTART_Set) != (uint32_t)RESET)
  {
    bitstatus = SET;
  }
  else
  {
    bitstatus = RESET;
  }

  return  bitstatus;
}

/*******************************************************************************
* Function Name  : ADC_DiscModeChannelCountConfig
* Description    : Configures the discontinuous mode for the selected ADC regular
*      group channel.
* Input          : ADCx:
*                    where x can be 1 to select the ADC peripheral.
*                  Number: specifies the discontinuous mode regular channel
*       count value.
*                    This number must be between 1 and 8.
* Return         : None
*******************************************************************************/
void ADC_DiscModeChannelCountConfig(ADC_TypeDef* ADCx, uint8_t Number)
{
  uint32_t tmpreg1 = 0;
  uint32_t tmpreg2 = 0;

