RT-Thread/rt-thread/bsp/wch/arm/libraries/CH32F10x_StdPeriph_Driver/StdPeriph_Driver/src/ch32f10x_adc.c
  tmpreg1 = ADCx->CTLR1;
  tmpreg1 &= CTLR1_DISCNUM_Reset;
  tmpreg2 = Number - 1;
  tmpreg1 |= tmpreg2 << 13;
  ADCx->CTLR1 = tmpreg1;
}

/*******************************************************************************
* Function Name  : ADC_DiscModeCmd
* Description    : Enables or disables the discontinuous mode on regular group
*      channel for the specified ADC.
* Input          : ADCx:
*                    where x can be 1 to select the ADC peripheral.
*                  NewState: ENABLE or DISABLE.
* Return         : None
*******************************************************************************/
void ADC_DiscModeCmd(ADC_TypeDef* ADCx, FunctionalState NewState)
{
  if (NewState != DISABLE)
  {
    ADCx->CTLR1 |= CTLR1_DISCEN_Set;
  }
  else
  {
    ADCx->CTLR1 &= CTLR1_DISCEN_Reset;
  }
}

/*******************************************************************************
* Function Name  : ADC_RegularChannelConfig
* Description    : Configures for the selected ADC regular channel its corresponding
*      rank in the sequencer and its sample time.
* Input          : ADCx:
*                    where x can be 1 to select the ADC peripheral.
*                  ADC_Channel: the ADC channel to configure.
*                    ADC_Channel_0: ADC Channel0 selected.
*                    ADC_Channel_1: ADC Channel1 selected.
*                    ADC_Channel_2: ADC Channel2 selected.
*                    ADC_Channel_3: ADC Channel3 selected.
*                    ADC_Channel_4: ADC Channel4 selected.
*                    ADC_Channel_5: ADC Channel5 selected.
*                    ADC_Channel_6: ADC Channel6 selected.
*                    ADC_Channel_7: ADC Channel7 selected.
*                    ADC_Channel_8: ADC Channel8 selected.
*                    ADC_Channel_9: ADC Channel9 selected.
*                    ADC_Channel_10: ADC Channel10 selected.
*                    ADC_Channel_11: ADC Channel11 selected.
*                    ADC_Channel_12: ADC Channel12 selected.
*                    ADC_Channel_13: ADC Channel13 selected.
*                    ADC_Channel_14: ADC Channel14 selected.
*                    ADC_Channel_15: ADC Channel15 selected.
*                    ADC_Channel_16: ADC Channel16 selected.
*                    ADC_Channel_17: ADC Channel17 selected.
*                  Rank: The rank in the regular group sequencer.
*                    This parameter must be between 1 to 16.
*                  ADC_SampleTime: The sample time value to be set for the selected channel.
*                    ADC_SampleTime_1Cycles5: Sample time equal to 1.5 cycles.
*                    ADC_SampleTime_7Cycles5: Sample time equal to 7.5 cycles.
*                    ADC_SampleTime_13Cycles5: Sample time equal to 13.5 cycles.
*                    ADC_SampleTime_28Cycles5: Sample time equal to 28.5 cycles.	
*                    ADC_SampleTime_41Cycles5: Sample time equal to 41.5 cycles.	
*                    ADC_SampleTime_55Cycles5: Sample time equal to 55.5 cycles.	
*                    ADC_SampleTime_71Cycles5: Sample time equal to 71.5 cycles.	
*                    ADC_SampleTime_239Cycles5: Sample time equal to 239.5 cycles.	                   
* Return         : None
*******************************************************************************/
void ADC_RegularChannelConfig(ADC_TypeDef* ADCx, uint8_t ADC_Channel, uint8_t Rank, uint8_t ADC_SampleTime)
{
  uint32_t tmpreg1 = 0, tmpreg2 = 0;

  if (ADC_Channel > ADC_Channel_9)
  {
    tmpreg1 = ADCx->SAMPTR1;
    tmpreg2 = SAMPTR1_SMP_Set << (3 * (ADC_Channel - 10));
    tmpreg1 &= ~tmpreg2;
    tmpreg2 = (uint32_t)ADC_SampleTime << (3 * (ADC_Channel - 10));
    tmpreg1 |= tmpreg2;
    ADCx->SAMPTR1 = tmpreg1;
  }
  else 
  {
    tmpreg1 = ADCx->SAMPTR2;
    tmpreg2 = SAMPTR2_SMP_Set << (3 * ADC_Channel);
    tmpreg1 &= ~tmpreg2;
    tmpreg2 = (uint32_t)ADC_SampleTime << (3 * ADC_Channel);
    tmpreg1 |= tmpreg2;
    ADCx->SAMPTR2 = tmpreg1;
  }

  if (Rank < 7)
  {
    tmpreg1 = ADCx->RSQR3;
    tmpreg2 = RSQR3_SQ_Set << (5 * (Rank - 1));
    tmpreg1 &= ~tmpreg2;
    tmpreg2 = (uint32_t)ADC_Channel << (5 * (Rank - 1));
    tmpreg1 |= tmpreg2;
    ADCx->RSQR3 = tmpreg1;
  }
  else if (Rank < 13)
  {
    tmpreg1 = ADCx->RSQR2;
    tmpreg2 = RSQR2_SQ_Set << (5 * (Rank - 7));
    tmpreg1 &= ~tmpreg2;
    tmpreg2 = (uint32_t)ADC_Channel << (5 * (Rank - 7));
    tmpreg1 |= tmpreg2;
    ADCx->RSQR2 = tmpreg1;
  }
  else
  {
    tmpreg1 = ADCx->RSQR1;
    tmpreg2 = RSQR1_SQ_Set << (5 * (Rank - 13));
    tmpreg1 &= ~tmpreg2;
    tmpreg2 = (uint32_t)ADC_Channel << (5 * (Rank - 13));
    tmpreg1 |= tmpreg2;
    ADCx->RSQR1 = tmpreg1;
  }
}

/*******************************************************************************
* Function Name  : ADC_ExternalTrigConvCmd
* Description    : Enables or disables the ADCx conversion through external trigger.
* Input          : ADCx:
*                    where x can be 1 to select the ADC peripheral.
*                  NewState: ENABLE or DISABLE.
* Return         : None
*******************************************************************************/
void ADC_ExternalTrigConvCmd(ADC_TypeDef* ADCx, FunctionalState NewState)
{
  if (NewState != DISABLE)
  {
    ADCx->CTLR2 |= CTLR2_EXTTRIG_Set;
  }
  else
  {
    ADCx->CTLR2 &= CTLR2_EXTTRIG_Reset;
  }
}

/*******************************************************************************
* Function Name  : ADC_GetConversionValue
* Description    : Returns the last ADCx conversion result data for regular channel.
* Input          : ADCx:
*                    where x can be 1 to select the ADC peripheral.
* Return         : ADCx->RDATAR:
*                    The Data conversion value.
*******************************************************************************/
uint16_t ADC_GetConversionValue(ADC_TypeDef* ADCx)
{
  return (uint16_t) ADCx->RDATAR;
}

/*******************************************************************************
* Function Name  : ADC_GetDualModeConversionValue
* Description    : Returns the last ADC1 and ADC2 conversion result data in dual mode.
* Input          : None
* Return         : RDATAR_ADDRESS:
*                    The Data conversion value.
*******************************************************************************/
uint32_t ADC_GetDualModeConversionValue(void)
{
  return (*(__IO uint32_t *) RDATAR_ADDRESS);
}

