RT-Thread/rt-thread/bsp/wch/arm/libraries/CH32F10x_StdPeriph_Driver/StdPeriph_Driver/src/ch32f10x_adc.c
  tmpreg = ADCx->CTLR1;
  tmpreg &= CTLR1_AWDCH_Reset;
  tmpreg |= ADC_Channel;
  ADCx->CTLR1 = tmpreg;
}

/*******************************************************************************
* Function Name  : ADC_TempSensorVrefintCmd
* Description    : Enables or disables the temperature sensor and Vrefint channel.
* Input          : NewState: ENABLE or DISABLE.
* Return         : None
*******************************************************************************/
void ADC_TempSensorVrefintCmd(FunctionalState NewState)
{
  if (NewState != DISABLE)
  {
    ADC1->CTLR2 |= CTLR2_TSVREFE_Set;
  }
  else
  {
    ADC1->CTLR2 &= CTLR2_TSVREFE_Reset;
  }
}

/*******************************************************************************
* Function Name  : ADC_GetFlagStatus
* Description    : Checks whether the specified ADC flag is set or not.
* Input          : ADCx:
*                    where x can be 1 to select the ADC peripheral.
*                  ADC_FLAG: specifies the flag to check.
*                    ADC_FLAG_AWD: Analog watchdog flag.
*                    ADC_FLAG_EOC: End of conversion flag.
*                    ADC_FLAG_JEOC: End of injected group conversion flag.
*                    ADC_FLAG_JSTRT: Start of injected group conversion flag.
*                    ADC_FLAG_STRT: Start of regular group conversion flag.
* Return         : FlagStatus: SET or RESET.
*******************************************************************************/
FlagStatus ADC_GetFlagStatus(ADC_TypeDef* ADCx, uint8_t ADC_FLAG)
{
  FlagStatus bitstatus = RESET;

  if ((ADCx->STATR & ADC_FLAG) != (uint8_t)RESET)
  {
    bitstatus = SET;
  }
  else
  {
    bitstatus = RESET;
  }

  return  bitstatus;
}

/*******************************************************************************
* Function Name  : ADC_ClearFlag
* Description    : Clears the ADCx's pending flags.
* Input          : ADCx:
*                    where x can be 1 to select the ADC peripheral.
*                  ADC_FLAG: specifies the flag to clear.
*                    ADC_FLAG_AWD: Analog watchdog flag.
*                    ADC_FLAG_EOC: End of conversion flag.
*                    ADC_FLAG_JEOC: End of injected group conversion flag.
*                    ADC_FLAG_JSTRT: Start of injected group conversion flag.
*                    ADC_FLAG_STRT: Start of regular group conversion flag.
* Return         : None
*******************************************************************************/
void ADC_ClearFlag(ADC_TypeDef* ADCx, uint8_t ADC_FLAG)
{
  ADCx->STATR = ~(uint32_t)ADC_FLAG;
}

/*******************************************************************************
* Function Name  : ADC_GetITStatus
* Description    : Checks whether the specified ADC interrupt has occurred or not.
* Input          : ADCx:
*                    where x can be 1 to select the ADC peripheral.
*                  ADC_IT: specifies the ADC interrupt source to check.
*                    ADC_IT_EOC: End of conversion interrupt mask.
*                    ADC_IT_AWD: Analog watchdog interrupt mask.
*                    ADC_IT_JEOC: End of injected conversion interrupt mask.
* Return         : ITStatus: SET or RESET.
*******************************************************************************/
ITStatus ADC_GetITStatus(ADC_TypeDef* ADCx, uint16_t ADC_IT)
{
  ITStatus bitstatus = RESET;
  uint32_t itmask = 0, enablestatus = 0;

  itmask = ADC_IT >> 8;
  enablestatus = (ADCx->CTLR1 & (uint8_t)ADC_IT) ;
	
  if (((ADCx->STATR & itmask) != (uint32_t)RESET) && enablestatus)
  {
    bitstatus = SET;
  }
  else
  {
    bitstatus = RESET;
  }

  return  bitstatus;
}

/*******************************************************************************
* Function Name  : ADC_ClearITPendingBit
* Description    : Clears the ADCx's interrupt pending bits.
* Input          : ADCx:
*                    where x can be 1 to select the ADC peripheral.
*                  ADC_IT: specifies the ADC interrupt pending bit to clear.
*                    ADC_IT_EOC: End of conversion interrupt mask.
*                    ADC_IT_AWD: Analog watchdog interrupt mask.
*                    ADC_IT_JEOC: End of injected conversion interrupt mask.
* Return         : None
*******************************************************************************/
void ADC_ClearITPendingBit(ADC_TypeDef* ADCx, uint16_t ADC_IT)
{
  uint8_t itmask = 0;

  itmask = (uint8_t)(ADC_IT >> 8);
  ADCx->STATR = ~(uint32_t)itmask;
}





